AlexBeem/Ariadne-Bootloader/boards.txt
# For use with Arduino IDE 1.0.x
# These boards assume Ethernet Shield is being used and bootloader blink is enabled
# You can change the value of bootloader.file for other configurations
##############################################################

ariadne328p_16mhz_blink_shield_standard.name=ATmega328P 16MHz, 6 Analog Inputs, Ariadne Bootloader

ariadne328p_16mhz_blink_shield_standard.upload.protocol=arduino
ariadne328p_16mhz_blink_shield_standard.upload.maximum_size=28672
ariadne328p_16mhz_blink_shield_standard.upload.speed=115200

ariadne328p_16mhz_blink_shield_standard.bootloader.low_fuses=0xFF
ariadne328p_16mhz_blink_shield_standard.bootloader.high_fuses=0xD8
ariadne328p_16mhz_blink_shield_standard.bootloader.extended_fuses=0x05
ariadne328p_16mhz_blink_shield_standard.bootloader.path=ariadne
ariadne328p_16mhz_blink_shield_standard.bootloader.file=ariadne_atmega328_16mhz_blink_shield.hex
ariadne328p_16mhz_blink_shield_standard.bootloader.unlock_bits=0x3F
ariadne328p_16mhz_blink_shield_standard.bootloader.lock_bits=0x0F

ariadne328p_16mhz_blink_shield_standard.build.mcu=atmega328p
ariadne328p_16mhz_blink_shield_standard.build.f_cpu=16000000L
ariadne328p_16mhz_blink_shield_standard.build.core=arduino:arduino
ariadne328p_16mhz_blink_shield_standard.build.variant=arduino:standard

##############################################################

ariadne328p_16mhz_blink_shield_eightanaloginputs.name=ATmega328P 16MHz, 8 Analog Inputs, Ariadne Bootloader

ariadne328p_16mhz_blink_shield_eightanaloginputs.upload.protocol=arduino
ariadne328p_16mhz_blink_shield_eightanaloginputs.upload.maximum_size=28672
ariadne328p_16mhz_blink_shield_eightanaloginputs.upload.speed=115200

ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.low_fuses=0xFF
ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.high_fuses=0xD8
ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.extended_fuses=0x05
ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.path=ariadne
ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.file=ariadne_atmega328_16mhz_blink_shield.hex
ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.unlock_bits=0x3F
ariadne328p_16mhz_blink_shield_eightanaloginputs.bootloader.lock_bits=0x0F

ariadne328p_16mhz_blink_shield_eightanaloginputs.build.mcu=atmega328p
ariadne328p_16mhz_blink_shield_eightanaloginputs.build.f_cpu=16000000L
ariadne328p_16mhz_blink_shield_eightanaloginputs.build.core=arduino:arduino
ariadne328p_16mhz_blink_shield_eightanaloginputs.build.variant=arduino:eightanaloginputs

##############################################################

ariadneethernet_blink.name=Arduino Ethernet, Ariadne Bootloader

ariadneethernet_blink.upload.protocol=arduino
ariadneethernet_blink.upload.maximum_size=28672
ariadneethernet_blink.upload.speed=115200

ariadneethernet_blink.bootloader.low_fuses=0xFF
ariadneethernet_blink.bootloader.high_fuses=0xD8
ariadneethernet_blink.bootloader.extended_fuses=0x05
ariadneethernet_blink.bootloader.path=ariadne
ariadneethernet_blink.bootloader.file=ariadne_atmega328_16mhz_blink_arduinoethernet.hex
ariadneethernet_blink.bootloader.unlock_bits=0x3F
ariadneethernet_blink.bootloader.lock_bits=0x0F

ariadneethernet_blink.build.mcu=atmega328p
ariadneethernet_blink.build.f_cpu=16000000L
ariadneethernet_blink.build.core=arduino:arduino
ariadneethernet_blink.build.variant=arduino:standard

##############################################################

ariadne2560_blink_shield.name=Arduino Mega 2560, Ariadne Bootloader

ariadne2560_blink_shield.upload.protocol=stk500v2
ariadne2560_blink_shield.upload.maximum_size=258048
ariadne2560_blink_shield.upload.speed=115200

ariadne2560_blink_shield.bootloader.low_fuses=0xFF
ariadne2560_blink_shield.bootloader.high_fuses=0xDA
ariadne2560_blink_shield.bootloader.extended_fuses=0xFD
ariadne2560_blink_shield.bootloader.path=ariadne
ariadne2560_blink_shield.bootloader.file=ariadne_atmega2560_16mhz_blink_shield.hex
ariadne2560_blink_shield.bootloader.unlock_bits=0x3F
ariadne2560_blink_shield.bootloader.lock_bits=0x0F

ariadne2560_blink_shield.build.mcu=atmega2560
ariadne2560_blink_shield.build.f_cpu=16000000L
ariadne2560_blink_shield.build.core=arduino:arduino
ariadne2560_blink_shield.build.variant=arduino:mega

##############################################################

# The Full Swing oscillator setting is more resistant to electrical interference than Low Power
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.name=ATmega1284P 16MHz avr-developers.com pinout, Ariadne Bootloader

ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.upload.protocol=arduino
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.upload.maximum_size=126976
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.upload.speed=115200

ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.low_fuses=0xF7
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.high_fuses=0xDA
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.extended_fuses=0xFD
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.path=ariadne
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.file=ariadne_atmega1284p_16mhz_blink_shield_avrdevelopersstandard.hex
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.unlock_bits=0x3F
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.bootloader.lock_bits=0x0F

ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.build.mcu=atmega1284p
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.build.f_cpu=16000000L
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.build.core=arduino:arduino
ariadne1284p_16mhz_fullswing_blink_shield_avrdevelopers.build.variant=avr_developers
